# RevitAPIPostDocEventArgs Class (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
RevitAPIPostDocEventArgs Class
Members See Also
---
The base class used for post events where the arguments must supply access to the document.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2010
# Syntax
C#
---
```text
public class RevitAPIPostDocEventArgs : RevitAPIPostEventArgs
```

Visual Basic
---
```text
Public Class RevitAPIPostDocEventArgs _
	Inherits RevitAPIPostEventArgs
```

Visual C++
---
```text
public ref class RevitAPIPostDocEventArgs : public RevitAPIPostEventArgs
```

# Inheritance Hierarchy
System..::..Object System..::..EventArgs Autodesk.Revit.DB.Events..::..RevitAPIEventArgs Autodesk.Revit.DB.Events..::..RevitAPIPostEventArgs Autodesk.Revit.DB.Events..::..RevitAPIPostDocEventArgs Autodesk.Revit.DB.Events..::..DocumentCreatedEventArgs Autodesk.Revit.DB.Events..::..DocumentOpenedEventArgs Autodesk.Revit.DB.Events..::..DocumentPrintedEventArgs Autodesk.Revit.DB.Events..::..DocumentReloadedLatestEventArgs Autodesk.Revit.DB.Events..::..DocumentSavedAsEventArgs Autodesk.Revit.DB.Events..::..DocumentSavedEventArgs Autodesk.Revit.DB.Events..::..DocumentSynchronizedWithCentralEventArgs Autodesk.Revit.DB.Events..::..ElementTypeDuplicatedEventArgs Autodesk.Revit.DB.Events..::..FamilyLoadedIntoDocumentEventArgs Autodesk.Revit.DB.Events..::..FileExportedEventArgs Autodesk.Revit.DB.Events..::..FileImportedEventArgs Autodesk.Revit.DB.Events..::..LinkedResourceOpenedEventArgs Autodesk.Revit.DB.Events..::..ViewExportedEventArgs Autodesk.Revit.DB.Events..::..ViewPrintedEventArgs Autodesk.Revit.DB.Events..::..ViewsExportedByContextEventArgs Autodesk.Revit.UI.Events..::..ViewActivatedEventArgs
# See Also
RevitAPIPostDocEventArgs Members
Autodesk.Revit.DB.Events Namespace